import type { DataRelationship } from "@orbcharts/core-types"

export default <DataRelationship>{
  nodes: [
    {
        "id": "80333992",
        "label": "中國信託金融控股股份有限公司",
        "value": 287742539,
        "categoryLabel": "法人"
    },
    {
        "id": "90525822",
        "label": "生達電力股份有限公司",
        "value": 100000,
        "categoryLabel": "法人"
    },
    {
        "id": "50883920",
        "label": "中信證創業投資股份有限公司",
        "value": 149747428,
        "categoryLabel": "法人"
    },
    {
        "id": "82798150",
        "label": "睿點行動股份有限公司",
        "value": 43800000,
        "categoryLabel": "法人"
    },
    {
        "id": "23035564",
        "label": "西基電腦動畫股份有限公司",
        "value": 31823501,
        "categoryLabel": "法人"
    },
    {
        "id": "91085695",
        "label": "比爾倍里股份有限公司",
        "value": 900000,
        "categoryLabel": "法人"
    },
    {
        "id": "顏陳利智",
        "label": "顏陳利智",
        "value": 0,
        "categoryLabel": "自然人"
    },
    {
        "id": "83698209",
        "label": "生和電力股份有限公司",
        "value": 300000,
        "categoryLabel": "法人"
    },
    {
        "id": "24550172",
        "label": "群馥科技股份有限公司",
        "value": 572139,
        "categoryLabel": "法人"
    },
    {
        "id": "50790818",
        "label": "日運綠能股份有限公司",
        "value": 112000000,
        "categoryLabel": "法人"
    },
    {
        "id": "90480682",
        "label": "小馬飲夢股份有限公司",
        "value": 4040000,
        "categoryLabel": "法人"
    },
    {
        "id": "82963411",
        "label": "方登綠能股份有限公司",
        "value": 22600000,
        "categoryLabel": "法人"
    },
    {
        "id": "69800512",
        "label": "新農科技股份有限公司",
        "value": 26072000,
        "categoryLabel": "法人"
    },
    {
        "id": "52809996",
        "label": "邑流微測股份有限公司",
        "value": 10992371,
        "categoryLabel": "法人"
    },
    {
        "id": "90652354",
        "label": "嘉大蛋品股份有限公司",
        "value": 3800000,
        "categoryLabel": "法人"
    },
    {
        "id": "24977373",
        "label": "翔探科技股份有限公司",
        "value": 31303492,
        "categoryLabel": "法人"
    },
    {
        "id": "29183154",
        "label": "創勁綠能股份有限公司",
        "value": 18500000,
        "categoryLabel": "法人"
    },
    {
        "id": "83299441",
        "label": "仁華綠能股份有限公司",
        "value": 22722000,
        "categoryLabel": "法人"
    },
    {
        "id": "90511550",
        "label": "中國信託資本有限公司",
        "value": null,
        "categoryLabel": "法人"
    },
    {
        "id": "16744111",
        "label": "財金資訊股份有限公司",
        "value": 2231557500,
        "categoryLabel": "法人"
    },
    {
        "id": "英屬維京群島商 WEALTHY WONDER GROUP LIMITED",
        "label": "英屬維京群島商 WEALTHY WONDER GROUP LIMITED",
        "value": 0,
        "categoryLabel": "外資法人"
    },
    {
        "id": "42955111",
        "label": "生利能源股份有限公司",
        "value": 70800000,
        "categoryLabel": "法人"
    },
    {
        "id": "70845988",
        "label": "宜高投資股份有限公司",
        "value": 40400000,
        "categoryLabel": "法人"
    },
    {
        "id": "28855251",
        "label": "麻布數據科技股份有限公司",
        "value": 1032539,
        "categoryLabel": "法人"
    },
    {
        "id": "83093383",
        "label": "生耀電力股份有限公司",
        "value": 100000,
        "categoryLabel": "法人"
    },
    {
        "id": "83566376",
        "label": "台灣風能投資股份有限公司",
        "value": 346336087,
        "categoryLabel": "法人"
    },
    {
        "id": "85016762",
        "label": "奧暢雲服務股份有限公司",
        "value": 24645000,
        "categoryLabel": "法人"
    },
    {
        "id": "劉長春",
        "label": "劉長春",
        "value": 0,
        "categoryLabel": "自然人"
    },
    {
        "id": "70827383",
        "label": "中華開發金融控股股份有限公司",
        "value": 399211904,
        "categoryLabel": "法人"
    },
    {
        "id": "42369647",
        "label": "西島風力發電股份有限公司",
        "value": 699076800,
        "categoryLabel": "法人"
    },
    {
        "id": "70759028",
        "label": "臺灣網路認證股份有限公司",
        "value": 71855154,
        "categoryLabel": "法人"
    },
    {
        "id": "82887701",
        "label": "台灣先進智慧股份有限公司",
        "value": 12061208,
        "categoryLabel": "法人"
    },
    {
        "id": "90888464",
        "label": "台菱能源科技股份有限公司",
        "value": 7250000,
        "categoryLabel": "法人"
    },
    {
        "id": "50754236",
        "label": "合方創意股份有限公司",
        "value": 17720000,
        "categoryLabel": "法人"
    },
    {
        "id": "68682214",
        "label": "日辰太陽能股份有限公司",
        "value": 6200000,
        "categoryLabel": "法人"
    },
    {
        "id": "90674527",
        "label": "配客永續整合股份有限公司",
        "value": 1097707,
        "categoryLabel": "法人"
    },
    {
        "id": "83567059",
        "label": "科文双融投資顧問股份有限公司",
        "value": 10900000,
        "categoryLabel": "法人"
    },
    {
        "id": "04212250",
        "label": "國喬石油化學股份有限公司",
        "value": 48742722,
        "categoryLabel": "法人"
    },
    {
        "id": "85069970",
        "label": "生豐電力股份有限公司",
        "value": 84500000,
        "categoryLabel": "法人"
    },
    {
        "id": "64457969",
        "label": "莊園二十六號科技股份有限公司",
        "value": 1500000,
        "categoryLabel": "法人"
    },
    {
        "id": "90600413",
        "label": "星鱻電力股份有限公司",
        "value": 48000000,
        "categoryLabel": "法人"
    },
    {
        "id": "83711478",
        "label": "交流資服股份有限公司",
        "value": 8000000,
        "categoryLabel": "法人"
    },
    {
        "id": "54996361",
        "label": "新和能源開發股份有限公司",
        "value": 84250000,
        "categoryLabel": "法人"
    },
    {
        "id": "53318717",
        "label": "宸定科技股份有限公司",
        "value": 2877433,
        "categoryLabel": "法人"
    },
    {
        "id": "90411052",
        "label": "和順興管理顧問股份有限公司",
        "value": 6800000,
        "categoryLabel": "法人"
    },
    {
        "id": "52584292",
        "label": "火星貓科技股份有限公司",
        "value": 3270000,
        "categoryLabel": "法人"
    },
    {
        "id": "53046737",
        "label": "綠燿能源股份有限公司",
        "value": 31314000,
        "categoryLabel": "法人"
    },
    {
        "id": "42966996",
        "label": "康邁醫學科技股份有限公司",
        "value": 32500000,
        "categoryLabel": "法人"
    },
    {
        "id": "54075581",
        "label": "牧陽能控股份有限公司",
        "value": 6390773,
        "categoryLabel": "法人"
    },
    {
        "id": "80328870",
        "label": "中華開發創業投資股份有限公司",
        "value": 2141974830,
        "categoryLabel": "法人"
    },
    {
        "id": "83932084",
        "label": "匯群能源股份有限公司",
        "value": 10000000,
        "categoryLabel": "法人"
    },
    {
        "id": "50796051",
        "label": "日景綠能股份有限公司",
        "value": 3000000,
        "categoryLabel": "法人"
    },
    {
        "id": "24920421",
        "label": "牧陽人系統股份有限公司",
        "value": 33731450,
        "categoryLabel": "法人"
    },
    {
        "id": "24385342",
        "label": "喧嘩股份有限公司",
        "value": 9584000,
        "categoryLabel": "法人"
    },
    {
        "id": "85099670",
        "label": "台灣智慧農業服務股份有限公司",
        "value": 999997,
        "categoryLabel": "法人"
    },
    {
        "id": "85062293",
        "label": "茂正能源股份有限公司",
        "value": 140000000,
        "categoryLabel": "法人"
    },
    {
        "id": "季崇慧",
        "label": "季崇慧",
        "value": 0,
        "categoryLabel": "自然人"
    },
    {
        "id": "52583081",
        "label": "匯雲數位股份有限公司",
        "value": 4591790,
        "categoryLabel": "法人"
    },
    {
        "id": "50871229",
        "label": "車博資訊系統股份有限公司",
        "value": 6396200,
        "categoryLabel": "法人"
    },
    {
        "id": "80021533",
        "label": "中國信託資產管理股份有限公司",
        "value": 1415292000,
        "categoryLabel": "法人"
    },
    {
        "id": "12665305",
        "label": "財宏科技股份有限公司",
        "value": 47151321,
        "categoryLabel": "法人"
    },
    {
        "id": "90513831",
        "label": "新生豐投資股份有限公司",
        "value": 84543000,
        "categoryLabel": "法人"
    },
    {
        "id": "54818438",
        "label": "遠勁綠能股份有限公司",
        "value": 48200000,
        "categoryLabel": "法人"
    },
    {
        "id": "27771557",
        "label": "柏宇投資股份有限公司",
        "value": 40000000,
        "categoryLabel": "法人"
    },
    {
        "id": "83152761",
        "label": "星泓電力股份有限公司",
        "value": 88200000,
        "categoryLabel": "法人"
    },
    {
        "id": "83401516",
        "label": "双融域股份有限公司",
        "value": 12000000,
        "categoryLabel": "法人"
    },
    {
        "id": "89969642",
        "label": "中信保全股份有限公司",
        "value": 23847580,
        "categoryLabel": "法人"
    },
    {
        "id": "42922604",
        "label": "茂泓能源股份有限公司",
        "value": 51400000,
        "categoryLabel": "法人"
    },
    {
        "id": "24730689",
        "label": "臺灣比爾文化股份有限公司",
        "value": 7117500,
        "categoryLabel": "法人"
    },
    {
        "id": "53800305",
        "label": "禾羽能源股份有限公司",
        "value": 9678000,
        "categoryLabel": "法人"
    },
    {
        "id": "90877255",
        "label": "黃金稻埕股份有限公司",
        "value": 12600000,
        "categoryLabel": "法人"
    },
    {
        "id": "許文彥",
        "label": "許文彥",
        "value": 0,
        "categoryLabel": "自然人"
    },
    {
        "id": "90135681",
        "label": "華能國際娛樂股份有限公司",
        "value": 1000000,
        "categoryLabel": "法人"
    },
    {
        "id": "29050653",
        "label": "兆陽光電科技股份有限公司",
        "value": 27380875,
        "categoryLabel": "法人"
    },
    {
        "id": "50796067",
        "label": "日集綠能股份有限公司",
        "value": 10000000,
        "categoryLabel": "法人"
    },
    {
        "id": "83106599",
        "label": "双融藝股份有限公司",
        "value": 2080000,
        "categoryLabel": "法人"
    },
    {
        "id": "16092130",
        "label": "臺灣期貨交易所股份有限公司",
        "value": 162173746,
        "categoryLabel": "法人"
    },
    {
        "id": "82937081",
        "label": "益佳能源股份有限公司",
        "value": 14680000,
        "categoryLabel": "法人"
    },
    {
        "id": "23416851",
        "label": "中國信託綜合證券股份有限公司",
        "value": 5533179673,
        "categoryLabel": "法人"
    },
    {
        "id": "54804080",
        "label": "新農南台飼料股份有限公司",
        "value": 10000000,
        "categoryLabel": "法人"
    },
    {
        "id": "52687706",
        "label": "哥本哈根基礎設施彰芳股份有限公司",
        "value": 2800888104,
        "categoryLabel": "法人"
    },
    {
        "id": "16095410",
        "label": "台北金融大樓股份有限公司",
        "value": 3823004803,
        "categoryLabel": "法人"
    },
    {
        "id": "85055504",
        "label": "瀾電光能股份有限公司",
        "value": 4040000,
        "categoryLabel": "法人"
    },
    {
        "id": "53935556",
        "label": "華文創股份有限公司",
        "value": 13450000,
        "categoryLabel": "法人"
    },
    {
        "id": "07608804",
        "label": "唯國建設股份有限公司",
        "value": 4740,
        "categoryLabel": "法人"
    },
    {
        "id": "54376691",
        "label": "一卡通票證股份有限公司",
        "value": 455867587,
        "categoryLabel": "法人"
    },
    {
        "id": "84703601",
        "label": "台北外滙經紀股份有限公司",
        "value": 18460000,
        "categoryLabel": "法人"
    },
    {
        "id": "42369695",
        "label": "彰芳風力發電股份有限公司",
        "value": 7664268420,
        "categoryLabel": "法人"
    },
    {
        "id": "12656354",
        "label": "金財通商務科技服務股份有限公司",
        "value": 60300000,
        "categoryLabel": "法人"
    },
    {
        "id": "85062553",
        "label": "茂信能源股份有限公司",
        "value": 110000000,
        "categoryLabel": "法人"
    },
    {
        "id": "84449708",
        "label": "合眾資產管理股份有限公司",
        "value": 58208000,
        "categoryLabel": "法人"
    },
    {
        "id": "80355806",
        "label": "中國信託創業投資股份有限公司",
        "value": 3916006962,
        "categoryLabel": "法人"
    },
    {
        "id": "83549911",
        "label": "影響原創影視股份有限公司",
        "value": 15100000,
        "categoryLabel": "法人"
    },
    {
        "id": "46452701",
        "label": "直流電通股份有限公司",
        "value": 5130053,
        "categoryLabel": "法人"
    },
    {
        "id": "89398334",
        "label": "萬通票券金融股份有限公司",
        "value": 929692138,
        "categoryLabel": "法人"
    },
    {
        "id": "顏文澤",
        "label": "顏文澤",
        "value": 0,
        "categoryLabel": "自然人"
    },
    {
        "id": "91035675",
        "label": "中國信託育樂股份有限公司",
        "value": 30000000,
        "categoryLabel": "法人"
    },
    {
        "id": "53358718",
        "label": "宜詮投資股份有限公司",
        "value": 25600000,
        "categoryLabel": "法人"
    },
    {
        "id": "65905937",
        "label": "居家先生股份有限公司",
        "value": 16081251,
        "categoryLabel": "法人"
    },
    {
        "id": "54171803",
        "label": "仲遠投資股份有限公司",
        "value": 5360000,
        "categoryLabel": "法人"
    },
    {
        "id": "90672149",
        "label": "非貓不可股份有限公司",
        "value": 4000000,
        "categoryLabel": "法人"
    },
    {
        "id": "52477048",
        "label": "仁登太陽能股份有限公司",
        "value": 13200000,
        "categoryLabel": "法人"
    },
    {
        "id": "50884998",
        "label": "中華網家一號股份有限公司",
        "value": 100000000,
        "categoryLabel": "法人"
    },
    {
        "id": "56675977",
        "label": "禾碩綠電股份有限公司",
        "value": 42510000,
        "categoryLabel": "法人"
    },
    {
        "id": "16606102",
        "label": "網路家庭國際資訊股份有限公司",
        "value": 60266310,
        "categoryLabel": "法人"
    },
    {
        "id": "顏志光",
        "label": "顏志光",
        "value": 0,
        "categoryLabel": "自然人"
    },
    {
        "id": "03557017",
        "label": "台灣人壽保險股份有限公司",
        "value": 62385869165,
        "categoryLabel": "法人"
    },
    {
        "id": "11147207",
        "label": "中華開發資本股份有限公司",
        "value": 18370043217,
        "categoryLabel": "法人"
    },
    {
        "id": "24969958",
        "label": "中國信託證券投資顧問股份有限公司",
        "value": 20000000,
        "categoryLabel": "法人"
    },
    {
        "id": "50770720",
        "label": "台灣醫智股份有限公司",
        "value": 759576,
        "categoryLabel": "法人"
    },
    {
        "id": "03077208",
        "label": "中國信託商業銀行股份有限公司",
        "value": 177554623140,
        "categoryLabel": "法人"
    },
    {
        "id": "27938888",
        "label": "中國信託產物保險股份有限公司",
        "value": 4800000000,
        "categoryLabel": "法人"
    },
    {
        "id": "54508026",
        "label": "奇博科技股份有限公司",
        "value": 3622976,
        "categoryLabel": "法人"
    },
    {
        "id": "55696101",
        "label": "貓侍股份有限公司",
        "value": 779008,
        "categoryLabel": "法人"
    },
    {
        "id": "51559801",
        "label": "星耀能源股份有限公司",
        "value": 490000000,
        "categoryLabel": "法人"
    },
    {
        "id": "83239134",
        "label": "大慕可可股份有限公司",
        "value": 25100000,
        "categoryLabel": "法人"
    },
    {
        "id": "楊聲勇",
        "label": "楊聲勇",
        "value": 0,
        "categoryLabel": "自然人"
    },
    {
        "id": "53800430",
        "label": "禾豐能源股份有限公司",
        "value": 2920000,
        "categoryLabel": "法人"
    },
    {
        "id": "56642619",
        "label": "成勁電力股份有限公司",
        "value": 52250000,
        "categoryLabel": "法人"
    },
    {
        "id": "64960362",
        "label": "醫視科技股份有限公司",
        "value": 10770538,
        "categoryLabel": "法人"
    },
    {
        "id": "50927814",
        "label": "麗橙能源股份有限公司",
        "value": 8200000,
        "categoryLabel": "法人"
    },
    {
        "id": "53739652",
        "label": "群傳媒股份有限公司",
        "value": 10287571,
        "categoryLabel": "法人"
    },
    {
        "id": "83469851",
        "label": "天使放大股份有限公司",
        "value": 184400000,
        "categoryLabel": "法人"
    },
    {
        "id": "83195380",
        "label": "日曜能源股份有限公司",
        "value": 20000000,
        "categoryLabel": "法人"
    },
    {
        "id": "83299553",
        "label": "中鈁綠能股份有限公司",
        "value": 22800000,
        "categoryLabel": "法人"
    },
    {
        "id": "52690189",
        "label": "哥本哈根基礎設施西島股份有限公司",
        "value": 260921022,
        "categoryLabel": "法人"
    },
    {
        "id": "23223778",
        "label": "唯福投資股份有限公司",
        "value": 14300000,
        "categoryLabel": "法人"
    },
    {
        "id": "83477590",
        "label": "連線商業銀行股份有限公司",
        "value": 2999000000,
        "categoryLabel": "法人"
    },
    {
        "id": "24549210",
        "label": "關網資訊股份有限公司",
        "value": 1848736,
        "categoryLabel": "法人"
    },
    {
        "id": "50916648",
        "label": "配客嘉股份有限公司",
        "value": 6076478,
        "categoryLabel": "法人"
    },
    {
        "id": "05129188",
        "label": "仲冠投資股份有限公司",
        "value": 611978300,
        "categoryLabel": "法人"
    },
    {
        "id": "53800488",
        "label": "家禾能源股份有限公司",
        "value": 3778000,
        "categoryLabel": "法人"
    },
    {
        "id": "27942171",
        "label": "台灣彩券股份有限公司",
        "value": 499999999,
        "categoryLabel": "法人"
    },
    {
        "id": "52962610",
        "label": "時書數位內容股份有限公司",
        "value": 925000,
        "categoryLabel": "法人"
    },
    {
        "id": "52492792",
        "label": "悠勢科技股份有限公司",
        "value": 8730666,
        "categoryLabel": "法人"
    },
    {
        "id": "50984384",
        "label": "化石先生股份有限公司",
        "value": 1050400,
        "categoryLabel": "法人"
    },
    {
        "id": "27613642",
        "label": "鴻壬企業股份有限公司",
        "value": 4000000,
        "categoryLabel": "法人"
    },
    {
        "id": "50752434",
        "label": "睿元國際股份有限公司",
        "value": 37800000,
        "categoryLabel": "法人"
    },
    {
        "id": "54390700",
        "label": "臺灣行動支付股份有限公司",
        "value": 58800000,
        "categoryLabel": "法人"
    },
    {
        "id": "85091924",
        "label": "瀾晶伏電股份有限公司",
        "value": 7040000,
        "categoryLabel": "法人"
    },
    {
        "id": "84704496",
        "label": "凱基期貨股份有限公司",
        "value": 503695995,
        "categoryLabel": "法人"
    },
    {
        "id": "80503378",
        "label": "中國信託資融股份有限公司",
        "value": 535550430,
        "categoryLabel": "法人"
    },
    {
        "id": "42986310",
        "label": "鼎信傳能股份有限公司",
        "value": 1755249,
        "categoryLabel": "法人"
    },
    {
        "id": "52289539",
        "label": "神經元科技股份有限公司",
        "value": 33634822,
        "categoryLabel": "法人"
    },
    {
        "id": "24563795",
        "label": "全民大劇團股份有限公司",
        "value": 4050279,
        "categoryLabel": "法人"
    },
    {
        "id": "28087251",
        "label": "午資開發股份有限公司",
        "value": 241560000,
        "categoryLabel": "法人"
    },
    {
        "id": "23474232",
        "label": "臺灣集中保管結算所股份有限公司",
        "value": 1555899819,
        "categoryLabel": "法人"
    },
    {
        "id": "22522756",
        "label": "國亨化學股份有限公司",
        "value": 136800000,
        "categoryLabel": "法人"
    },
    {
        "id": "50891273",
        "label": "柒拾陸號原子股份有限公司",
        "value": 9050000,
        "categoryLabel": "法人"
    },
    {
        "id": "54667023",
        "label": "又米創新股份有限公司",
        "value": 3622756,
        "categoryLabel": "法人"
    },
    {
        "id": "50858582",
        "label": "台灣灣谷科技股份有限公司",
        "value": 52713003,
        "categoryLabel": "法人"
    },
    {
        "id": "66829016",
        "label": "臺灣時間好慢文化股份有限公司",
        "value": 120000,
        "categoryLabel": "法人"
    },
    {
        "id": "91119148",
        "label": "捷興物流股份有限公司",
        "value": 7500000,
        "categoryLabel": "法人"
    },
    {
        "id": "42866764",
        "label": "捷和物流股份有限公司",
        "value": 9295000,
        "categoryLabel": "法人"
    },
    {
        "id": "82871406",
        "label": "大福能源股份有限公司",
        "value": 59800000,
        "categoryLabel": "法人"
    },
    {
        "id": "23111915",
        "label": "凱基證券股份有限公司",
        "value": 16908629661,
        "categoryLabel": "法人"
    },
    {
        "id": "16439219",
        "label": "中國信託證券投資信託股份有限公司",
        "value": 153000000,
        "categoryLabel": "法人"
    },
    {
        "id": "顏志宇",
        "label": "顏志宇",
        "value": 0,
        "categoryLabel": "自然人"
    },
    {
        "id": "90099622",
        "label": "飛特士動物科技股份有限公司",
        "value": 5000000,
        "categoryLabel": "法人"
    },
    {
        "id": "52477011",
        "label": "元登太陽能股份有限公司",
        "value": 36000000,
        "categoryLabel": "法人"
    },
    {
        "id": "90219295",
        "label": "星紀元國際股份有限公司",
        "value": 102000000,
        "categoryLabel": "法人"
    },
    {
        "id": "50773233",
        "label": "瘋狂秀股份有限公司",
        "value": 3700000,
        "categoryLabel": "法人"
    },
    {
        "id": "90510460",
        "label": "台灣夢幻文創股份有限公司",
        "value": 35300000,
        "categoryLabel": "法人"
    },
    {
        "id": "24991987",
        "label": "合發土地開發股份有限公司",
        "value": 278320000,
        "categoryLabel": "法人"
    }
  ],
  edges: [
    {
        "id": "51559801->90525822",
        "label": "51559801->90525822",
        "categoryLabel": "自然人",
        "start": "51559801",
        "end": "90525822",
        "value": 100
    },
    {
      "id": "23416851->50883920",
      "label": "23416851->50883920",
      "categoryLabel": "自然人",
      "start": "23416851",
      "end": "50883920",
      "value": 100
    },
    {
        "id": "28855251->82798150",
        "label": "28855251->82798150",
        "categoryLabel": "自然人",
        "start": "28855251",
        "end": "82798150",
        "value": 100
    },
    {
        "id": "80355806->23035564",
        "label": "80355806->23035564",
        "categoryLabel": "自然人",
        "start": "80355806",
        "end": "23035564",
        "value": 4.84
    },
    {
        "id": "24730689->91085695",
        "label": "24730689->91085695",
        "categoryLabel": "自然人",
        "start": "24730689",
        "end": "91085695",
        "value": 40
    },
    {
        "id": "51559801->83698209",
        "label": "51559801->83698209",
        "categoryLabel": "自然人",
        "start": "51559801",
        "end": "83698209",
        "value": 100
    },
    {
        "id": "03077208->24550172",
        "label": "03077208->24550172",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "24550172",
        "value": 13.909256449165
    },
    {
        "id": "90600413->50790818",
        "label": "90600413->50790818",
        "categoryLabel": "自然人",
        "start": "90600413",
        "end": "50790818",
        "value": 100
    },
    {
        "id": "24730689->90480682",
        "label": "24730689->90480682",
        "categoryLabel": "自然人",
        "start": "24730689",
        "end": "90480682",
        "value": 14
    },
    {
        "id": "83152761->82963411",
        "label": "83152761->82963411",
        "categoryLabel": "自然人",
        "start": "83152761",
        "end": "82963411",
        "value": 100
    },
    {
        "id": "80355806->69800512",
        "label": "80355806->69800512",
        "categoryLabel": "自然人",
        "start": "80355806",
        "end": "69800512",
        "value": 8
    },
    {
        "id": "03077208->52809996",
        "label": "03077208->52809996",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "52809996",
        "value": 23.387472420098
    },
    {
        "id": "69800512->90652354",
        "label": "69800512->90652354",
        "categoryLabel": "自然人",
        "start": "69800512",
        "end": "90652354",
        "value": 90
    },
    {
        "id": "03077208->24977373",
        "label": "03077208->24977373",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "24977373",
        "value": 19.997776043505
    },
    {
        "id": "51559801->29183154",
        "label": "51559801->29183154",
        "categoryLabel": "自然人",
        "start": "51559801",
        "end": "29183154",
        "value": 100
    },
    {
        "id": "83152761->83299441",
        "label": "83152761->83299441",
        "categoryLabel": "自然人",
        "start": "83152761",
        "end": "83299441",
        "value": 100
    },
    {
        "id": "80355806->90511550",
        "label": "80355806->90511550",
        "categoryLabel": "自然人",
        "start": "80355806",
        "end": "90511550",
        "value": 100
    },
    {
        "id": "03077208->16744111",
        "label": "03077208->16744111",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "16744111",
        "value": 3.4125
    },
    {
        "id": "51559801->42955111",
        "label": "51559801->42955111",
        "categoryLabel": "自然人",
        "start": "51559801",
        "end": "42955111",
        "value": 100
    },
    {
        "id": "27771557->70845988",
        "label": "27771557->70845988",
        "categoryLabel": "自然人",
        "start": "27771557",
        "end": "70845988",
        "value": 100
    },
    {
        "id": "80355806->28855251",
        "label": "80355806->28855251",
        "categoryLabel": "自然人",
        "start": "80355806",
        "end": "28855251",
        "value": 14.617510247317
    },
    {
        "id": "51559801->83093383",
        "label": "51559801->83093383",
        "categoryLabel": "自然人",
        "start": "51559801",
        "end": "83093383",
        "value": 100
    },
    {
        "id": "03557017->83566376",
        "label": "03557017->83566376",
        "categoryLabel": "自然人",
        "start": "03557017",
        "end": "83566376",
        "value": 42.859665754924
    },
    {
        "id": "03077208->85016762",
        "label": "03077208->85016762",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "85016762",
        "value": 19.230769230769
    },
    {
        "id": "22522756->70827383",
        "label": "22522756->70827383",
        "categoryLabel": "自然人",
        "start": "22522756",
        "end": "70827383",
        "value": 0.06568902624516
    },
    {
        "id": "52690189->42369647",
        "label": "52690189->42369647",
        "categoryLabel": "自然人",
        "start": "52690189",
        "end": "42369647",
        "value": 100
    },
    {
        "id": "23474232->70759028",
        "label": "23474232->70759028",
        "categoryLabel": "自然人",
        "start": "23474232",
        "end": "70759028",
        "value": 18.083692
    },
    {
        "id": "16744111->70759028",
        "label": "16744111->70759028",
        "categoryLabel": "自然人",
        "start": "16744111",
        "end": "70759028",
        "value": 17.567
    },
    {
        "id": "03077208->82887701",
        "label": "03077208->82887701",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "82887701",
        "value": 12.66553644164
    },
    {
        "id": "56675977->90888464",
        "label": "56675977->90888464",
        "categoryLabel": "自然人",
        "start": "56675977",
        "end": "90888464",
        "value": 100
    },
    {
        "id": "83401516->50754236",
        "label": "83401516->50754236",
        "categoryLabel": "自然人",
        "start": "83401516",
        "end": "50754236",
        "value": 100
    },
    {
        "id": "83152761->68682214",
        "label": "83152761->68682214",
        "categoryLabel": "自然人",
        "start": "83152761",
        "end": "68682214",
        "value": 100
    },
    {
        "id": "80355806->90674527",
        "label": "80355806->90674527",
        "categoryLabel": "自然人",
        "start": "80355806",
        "end": "90674527",
        "value": 12.962008232267
    },
    {
        "id": "03077208->83567059",
        "label": "03077208->83567059",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "83567059",
        "value": 22.479593761184
    },
    {
        "id": "05129188->04212250",
        "label": "05129188->04212250",
        "categoryLabel": "自然人",
        "start": "05129188",
        "end": "04212250",
        "value": 3.050086550659
    },
    {
        "id": "90513831->85069970",
        "label": "90513831->85069970",
        "categoryLabel": "自然人",
        "start": "90513831",
        "end": "85069970",
        "value": 100
    },
    {
        "id": "03077208->64457969",
        "label": "03077208->64457969",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "64457969",
        "value": 26.666666666667
    },
    {
        "id": "23223778->80333992",
        "label": "23223778->80333992",
        "categoryLabel": "自然人",
        "start": "23223778",
        "end": "80333992",
        "value": 0.43780994873706
    },
    {
        "id": "53358718->80333992",
        "label": "53358718->80333992",
        "categoryLabel": "自然人",
        "start": "53358718",
        "end": "80333992",
        "value": 0.50157470858993
    },
    {
        "id": "54171803->80333992",
        "label": "54171803->80333992",
        "categoryLabel": "自然人",
        "start": "54171803",
        "end": "80333992",
        "value": 0.49943696074394
    },
    {
        "id": "楊聲勇->80333992",
        "label": "楊聲勇->80333992",
        "categoryLabel": "法人",
        "start": "楊聲勇",
        "end": "80333992",
        "value": 0.0001083863686774
    },
    {
        "id": "劉長春->80333992",
        "label": "劉長春->80333992",
        "categoryLabel": "法人",
        "start": "劉長春",
        "end": "80333992",
        "value": 0
    },
    {
        "id": "許文彥->80333992",
        "label": "許文彥->80333992",
        "categoryLabel": "法人",
        "start": "許文彥",
        "end": "80333992",
        "value": 0
    },
    {
        "id": "季崇慧->80333992",
        "label": "季崇慧->80333992",
        "categoryLabel": "法人",
        "start": "季崇慧",
        "end": "80333992",
        "value": 0
    },
    {
        "id": "03557017->90600413",
        "label": "03557017->90600413",
        "categoryLabel": "自然人",
        "start": "03557017",
        "end": "90600413",
        "value": 30
    },
    {
        "id": "46452701->83711478",
        "label": "46452701->83711478",
        "categoryLabel": "自然人",
        "start": "46452701",
        "end": "83711478",
        "value": 100
    },
    {
        "id": "03557017->54996361",
        "label": "03557017->54996361",
        "categoryLabel": "自然人",
        "start": "03557017",
        "end": "54996361",
        "value": 25
    },
    {
        "id": "03077208->53318717",
        "label": "03077208->53318717",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "53318717",
        "value": 8.8128104422638
    },
    {
        "id": "80355806->90411052",
        "label": "80355806->90411052",
        "categoryLabel": "自然人",
        "start": "80355806",
        "end": "90411052",
        "value": 70
    },
    {
        "id": "03077208->52584292",
        "label": "03077208->52584292",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "52584292",
        "value": 9.1160220994475
    },
    {
        "id": "56675977->53046737",
        "label": "56675977->53046737",
        "categoryLabel": "自然人",
        "start": "56675977",
        "end": "53046737",
        "value": 100
    },
    {
        "id": "03077208->42966996",
        "label": "03077208->42966996",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "42966996",
        "value": 5.8740601503759
    },
    {
        "id": "03077208->54075581",
        "label": "03077208->54075581",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "54075581",
        "value": 17.163417070868
    },
    {
        "id": "11147207->80328870",
        "label": "11147207->80328870",
        "categoryLabel": "自然人",
        "start": "11147207",
        "end": "80328870",
        "value": 100
    },
    {
        "id": "56675977->83932084",
        "label": "56675977->83932084",
        "categoryLabel": "自然人",
        "start": "56675977",
        "end": "83932084",
        "value": 100
    },
    {
        "id": "51559801->50796051",
        "label": "51559801->50796051",
        "categoryLabel": "自然人",
        "start": "51559801",
        "end": "50796051",
        "value": 100
    },
    {
        "id": "54075581->24920421",
        "label": "54075581->24920421",
        "categoryLabel": "自然人",
        "start": "54075581",
        "end": "24920421",
        "value": 100
    },
    {
        "id": "03077208->24385342",
        "label": "03077208->24385342",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "24385342",
        "value": 23.076923076923
    },
    {
        "id": "03077208->85099670",
        "label": "03077208->85099670",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "85099670",
        "value": 29.411723183367
    },
    {
        "id": "51559801->85062293",
        "label": "51559801->85062293",
        "categoryLabel": "自然人",
        "start": "51559801",
        "end": "85062293",
        "value": 100
    },
    {
        "id": "28855251->52583081",
        "label": "28855251->52583081",
        "categoryLabel": "自然人",
        "start": "28855251",
        "end": "52583081",
        "value": 17.442329801327
    },
    {
        "id": "03077208->50871229",
        "label": "03077208->50871229",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "50871229",
        "value": 25.641025641026
    },
    {
        "id": "80333992->80021533",
        "label": "80333992->80021533",
        "categoryLabel": "自然人",
        "start": "80333992",
        "end": "80021533",
        "value": 100
    },
    {
        "id": "16744111->12665305",
        "label": "16744111->12665305",
        "categoryLabel": "自然人",
        "start": "16744111",
        "end": "12665305",
        "value": 28.395068181818
    },
    {
        "id": "51559801->90513831",
        "label": "51559801->90513831",
        "categoryLabel": "自然人",
        "start": "51559801",
        "end": "90513831",
        "value": 75
    },
    {
        "id": "51559801->54818438",
        "label": "51559801->54818438",
        "categoryLabel": "自然人",
        "start": "51559801",
        "end": "54818438",
        "value": 100
    },
    {
        "id": "英屬維京群島商 WEALTHY WONDER GROUP LIMITED->27771557",
        "label": "英屬維京群島商 WEALTHY WONDER GROUP LIMITED->27771557",
        "categoryLabel": "法人",
        "start": "英屬維京群島商 WEALTHY WONDER GROUP LIMITED",
        "end": "27771557",
        "value": 100
    },
    {
        "id": "03557017->83152761",
        "label": "03557017->83152761",
        "categoryLabel": "自然人",
        "start": "03557017",
        "end": "83152761",
        "value": 30
    },
    {
        "id": "83567059->83401516",
        "label": "83567059->83401516",
        "categoryLabel": "自然人",
        "start": "83567059",
        "end": "83401516",
        "value": 95.170116583393
    },
    {
        "id": "80333992->89969642",
        "label": "80333992->89969642",
        "categoryLabel": "自然人",
        "start": "80333992",
        "end": "89969642",
        "value": 100
    },
    {
        "id": "83152761->42922604",
        "label": "83152761->42922604",
        "categoryLabel": "自然人",
        "start": "83152761",
        "end": "42922604",
        "value": 100
    },
    {
        "id": "03077208->24730689",
        "label": "03077208->24730689",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "24730689",
        "value": 12.630979138308
    },
    {
        "id": "56675977->53800305",
        "label": "56675977->53800305",
        "categoryLabel": "自然人",
        "start": "56675977",
        "end": "53800305",
        "value": 100
    },
    {
        "id": "03077208->90877255",
        "label": "03077208->90877255",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "90877255",
        "value": 38.095238095238
    },
    {
        "id": "53935556->90135681",
        "label": "53935556->90135681",
        "categoryLabel": "自然人",
        "start": "53935556",
        "end": "90135681",
        "value": 62.5
    },
    {
        "id": "83195380->29050653",
        "label": "83195380->29050653",
        "categoryLabel": "自然人",
        "start": "83195380",
        "end": "29050653",
        "value": 100
    },
    {
        "id": "51559801->50796067",
        "label": "51559801->50796067",
        "categoryLabel": "自然人",
        "start": "51559801",
        "end": "50796067",
        "value": 100
    },
    {
        "id": "83567059->83106599",
        "label": "83567059->83106599",
        "categoryLabel": "自然人",
        "start": "83567059",
        "end": "83106599",
        "value": 58
    },
    {
        "id": "23474232->16092130",
        "label": "23474232->16092130",
        "categoryLabel": "自然人",
        "start": "23474232",
        "end": "16092130",
        "value": 6.448245640812
    },
    {
        "id": "84704496->16092130",
        "label": "84704496->16092130",
        "categoryLabel": "自然人",
        "start": "84704496",
        "end": "16092130",
        "value": 3.5850173942528
    },
    {
        "id": "56675977->82937081",
        "label": "56675977->82937081",
        "categoryLabel": "自然人",
        "start": "56675977",
        "end": "82937081",
        "value": 100
    },
    {
        "id": "80333992->23416851",
        "label": "80333992->23416851",
        "categoryLabel": "自然人",
        "start": "80333992",
        "end": "23416851",
        "value": 100
    },
    {
        "id": "69800512->54804080",
        "label": "69800512->54804080",
        "categoryLabel": "自然人",
        "start": "69800512",
        "end": "54804080",
        "value": 100
    },
    {
        "id": "83566376->52687706",
        "label": "83566376->52687706",
        "categoryLabel": "自然人",
        "start": "83566376",
        "end": "52687706",
        "value": 17.500003994269
    },
    {
        "id": "03077208->16095410",
        "label": "03077208->16095410",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "16095410",
        "value": 3.0612244897959
    },
    {
        "id": "56675977->85055504",
        "label": "56675977->85055504",
        "categoryLabel": "自然人",
        "start": "56675977",
        "end": "85055504",
        "value": 100
    },
    {
        "id": "80355806->53935556",
        "label": "80355806->53935556",
        "categoryLabel": "自然人",
        "start": "80355806",
        "end": "53935556",
        "value": 19.230769230769
    },
    {
        "id": "顏文澤->07608804",
        "label": "顏文澤->07608804",
        "categoryLabel": "法人",
        "start": "顏文澤",
        "end": "07608804",
        "value": 0.14285714285714
    },
    {
        "id": "顏志宇->07608804",
        "label": "顏志宇->07608804",
        "categoryLabel": "法人",
        "start": "顏志宇",
        "end": "07608804",
        "value": 0
    },
    {
        "id": "顏陳利智->07608804",
        "label": "顏陳利智->07608804",
        "categoryLabel": "法人",
        "start": "顏陳利智",
        "end": "07608804",
        "value": 67.571428571429
    },
    {
        "id": "顏志光->07608804",
        "label": "顏志光->07608804",
        "categoryLabel": "法人",
        "start": "顏志光",
        "end": "07608804",
        "value": 0
    },
    {
        "id": "16744111->54376691",
        "label": "16744111->54376691",
        "categoryLabel": "自然人",
        "start": "16744111",
        "end": "54376691",
        "value": 3.5087719298246
    },
    {
        "id": "03077208->84703601",
        "label": "03077208->84703601",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "84703601",
        "value": 7.4672048435923
    },
    {
        "id": "52687706->42369695",
        "label": "52687706->42369695",
        "categoryLabel": "自然人",
        "start": "52687706",
        "end": "42369695",
        "value": 100
    },
    {
        "id": "16744111->12656354",
        "label": "16744111->12656354",
        "categoryLabel": "自然人",
        "start": "16744111",
        "end": "12656354",
        "value": 13.333333333333
    },
    {
        "id": "51559801->85062553",
        "label": "51559801->85062553",
        "categoryLabel": "自然人",
        "start": "51559801",
        "end": "85062553",
        "value": 100
    },
    {
        "id": "23223778->84449708",
        "label": "23223778->84449708",
        "categoryLabel": "自然人",
        "start": "23223778",
        "end": "84449708",
        "value": 75.025641025641
    },
    {
        "id": "07608804->84449708",
        "label": "07608804->84449708",
        "categoryLabel": "自然人",
        "start": "07608804",
        "end": "84449708",
        "value": 23.675213675214
    },
    {
        "id": "80333992->80355806",
        "label": "80333992->80355806",
        "categoryLabel": "自然人",
        "start": "80333992",
        "end": "80355806",
        "value": 100
    },
    {
        "id": "03077208->83549911",
        "label": "03077208->83549911",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "83549911",
        "value": 48.514851485149
    },
    {
        "id": "03077208->46452701",
        "label": "03077208->46452701",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "46452701",
        "value": 9.0499438292409
    },
    {
        "id": "03077208->89398334",
        "label": "03077208->89398334",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "89398334",
        "value": 21.153599852071
    },
    {
        "id": "80355806->91035675",
        "label": "80355806->91035675",
        "categoryLabel": "自然人",
        "start": "80355806",
        "end": "91035675",
        "value": 100
    },
    {
        "id": "70845988->53358718",
        "label": "70845988->53358718",
        "categoryLabel": "自然人",
        "start": "70845988",
        "end": "53358718",
        "value": 100
    },
    {
        "id": "03077208->65905937",
        "label": "03077208->65905937",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "65905937",
        "value": 9.4334370839938
    },
    {
        "id": "53358718->54171803",
        "label": "53358718->54171803",
        "categoryLabel": "自然人",
        "start": "53358718",
        "end": "54171803",
        "value": 29.761904761905
    },
    {
        "id": "70845988->54171803",
        "label": "70845988->54171803",
        "categoryLabel": "自然人",
        "start": "70845988",
        "end": "54171803",
        "value": 70.238095238095
    },
    {
        "id": "55696101->90672149",
        "label": "55696101->90672149",
        "categoryLabel": "自然人",
        "start": "55696101",
        "end": "90672149",
        "value": 100
    },
    {
        "id": "83152761->52477048",
        "label": "83152761->52477048",
        "categoryLabel": "自然人",
        "start": "83152761",
        "end": "52477048",
        "value": 100
    },
    {
        "id": "16606102->50884998",
        "label": "16606102->50884998",
        "categoryLabel": "自然人",
        "start": "16606102",
        "end": "50884998",
        "value": 50
    },
    {
        "id": "03557017->56675977",
        "label": "03557017->56675977",
        "categoryLabel": "自然人",
        "start": "03557017",
        "end": "56675977",
        "value": 30
    },
    {
        "id": "80328870->16606102",
        "label": "80328870->16606102",
        "categoryLabel": "自然人",
        "start": "80328870",
        "end": "16606102",
        "value": 1.4592136285288
    },
    {
        "id": "80333992->03557017",
        "label": "80333992->03557017",
        "categoryLabel": "自然人",
        "start": "80333992",
        "end": "03557017",
        "value": 100
    },
    {
        "id": "70827383->11147207",
        "label": "70827383->11147207",
        "categoryLabel": "自然人",
        "start": "70827383",
        "end": "11147207",
        "value": 100
    },
    {
        "id": "23416851->24969958",
        "label": "23416851->24969958",
        "categoryLabel": "自然人",
        "start": "23416851",
        "end": "24969958",
        "value": 100
    },
    {
        "id": "03077208->50770720",
        "label": "03077208->50770720",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "50770720",
        "value": 19.065759682151
    },
    {
        "id": "80333992->03077208",
        "label": "80333992->03077208",
        "categoryLabel": "自然人",
        "start": "80333992",
        "end": "03077208",
        "value": 100
    },
    {
        "id": "03557017->27938888",
        "label": "03557017->27938888",
        "categoryLabel": "自然人",
        "start": "03557017",
        "end": "27938888",
        "value": 100
    },
    {
        "id": "03077208->54508026",
        "label": "03077208->54508026",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "54508026",
        "value": 26.485833478185
    },
    {
        "id": "03077208->55696101",
        "label": "03077208->55696101",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "55696101",
        "value": 24.390243902439
    },
    {
        "id": "03557017->51559801",
        "label": "03557017->51559801",
        "categoryLabel": "自然人",
        "start": "03557017",
        "end": "51559801",
        "value": 30
    },
    {
        "id": "03077208->83239134",
        "label": "03077208->83239134",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "83239134",
        "value": 48.975512243878
    },
    {
        "id": "56675977->53800430",
        "label": "56675977->53800430",
        "categoryLabel": "自然人",
        "start": "56675977",
        "end": "53800430",
        "value": 100
    },
    {
        "id": "51559801->56642619",
        "label": "51559801->56642619",
        "categoryLabel": "自然人",
        "start": "51559801",
        "end": "56642619",
        "value": 100
    },
    {
        "id": "03077208->64960362",
        "label": "03077208->64960362",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "64960362",
        "value": 0
    },
    {
        "id": "56675977->50927814",
        "label": "56675977->50927814",
        "categoryLabel": "自然人",
        "start": "56675977",
        "end": "50927814",
        "value": 100
    },
    {
        "id": "16606102->53739652",
        "label": "16606102->53739652",
        "categoryLabel": "自然人",
        "start": "16606102",
        "end": "53739652",
        "value": 18.389165844028
    },
    {
        "id": "80355806->53739652",
        "label": "80355806->53739652",
        "categoryLabel": "自然人",
        "start": "80355806",
        "end": "53739652",
        "value": 2.677690029615
    },
    {
        "id": "03077208->83469851",
        "label": "03077208->83469851",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "83469851",
        "value": 40.281030444965
    },
    {
        "id": "03557017->83195380",
        "label": "03557017->83195380",
        "categoryLabel": "自然人",
        "start": "03557017",
        "end": "83195380",
        "value": 35
    },
    {
        "id": "83152761->83299553",
        "label": "83152761->83299553",
        "categoryLabel": "自然人",
        "start": "83152761",
        "end": "83299553",
        "value": 100
    },
    {
        "id": "83566376->52690189",
        "label": "83566376->52690189",
        "categoryLabel": "自然人",
        "start": "83566376",
        "end": "52690189",
        "value": 17.500066888026
    },
    {
        "id": "07608804->23223778",
        "label": "07608804->23223778",
        "categoryLabel": "自然人",
        "start": "07608804",
        "end": "23223778",
        "value": 8.6567164179104
    },
    {
        "id": "顏陳利智->23223778",
        "label": "顏陳利智->23223778",
        "categoryLabel": "法人",
        "start": "顏陳利智",
        "end": "23223778",
        "value": 29.253731343284
    },
    {
        "id": "84449708->23223778",
        "label": "84449708->23223778",
        "categoryLabel": "自然人",
        "start": "84449708",
        "end": "23223778",
        "value": 1.1940298507463
    },
    {
        "id": "顏文澤->23223778",
        "label": "顏文澤->23223778",
        "categoryLabel": "法人",
        "start": "顏文澤",
        "end": "23223778",
        "value": 3.5820895522388
    },
    {
        "id": "03077208->83477590",
        "label": "03077208->83477590",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "83477590",
        "value": 5
    },
    {
        "id": "03077208->24549210",
        "label": "03077208->24549210",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "24549210",
        "value": 11.60654154319
    },
    {
        "id": "90674527->50916648",
        "label": "90674527->50916648",
        "categoryLabel": "自然人",
        "start": "90674527",
        "end": "50916648",
        "value": 100
    },
    {
        "id": "顏文澤->05129188",
        "label": "顏文澤->05129188",
        "categoryLabel": "法人",
        "start": "顏文澤",
        "end": "05129188",
        "value": 0.175
    },
    {
        "id": "56675977->53800488",
        "label": "56675977->53800488",
        "categoryLabel": "自然人",
        "start": "56675977",
        "end": "53800488",
        "value": 100
    },
    {
        "id": "80333992->27942171",
        "label": "80333992->27942171",
        "categoryLabel": "自然人",
        "start": "80333992",
        "end": "27942171",
        "value": 100
    },
    {
        "id": "83469851->52962610",
        "label": "83469851->52962610",
        "categoryLabel": "自然人",
        "start": "83469851",
        "end": "52962610",
        "value": 4.9861621621622
    },
    {
        "id": "50884998->52492792",
        "label": "50884998->52492792",
        "categoryLabel": "自然人",
        "start": "50884998",
        "end": "52492792",
        "value": 13.767732966513
    },
    {
        "id": "03077208->52492792",
        "label": "03077208->52492792",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "52492792",
        "value": 14.631877156646
    },
    {
        "id": "03077208->50984384",
        "label": "03077208->50984384",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "50984384",
        "value": 27.022700814901
    },
    {
        "id": "56675977->27613642",
        "label": "56675977->27613642",
        "categoryLabel": "自然人",
        "start": "56675977",
        "end": "27613642",
        "value": 100
    },
    {
        "id": "28855251->50752434",
        "label": "28855251->50752434",
        "categoryLabel": "自然人",
        "start": "28855251",
        "end": "50752434",
        "value": 100
    },
    {
        "id": "16744111->54390700",
        "label": "16744111->54390700",
        "categoryLabel": "自然人",
        "start": "16744111",
        "end": "54390700",
        "value": 10
    },
    {
        "id": "56675977->85091924",
        "label": "56675977->85091924",
        "categoryLabel": "自然人",
        "start": "56675977",
        "end": "85091924",
        "value": 100
    },
    {
        "id": "23111915->84704496",
        "label": "23111915->84704496",
        "categoryLabel": "自然人",
        "start": "23111915",
        "end": "84704496",
        "value": 99.60978343154
    },
    {
        "id": "03557017->80503378",
        "label": "03557017->80503378",
        "categoryLabel": "自然人",
        "start": "03557017",
        "end": "80503378",
        "value": 100
    },
    {
        "id": "03077208->42986310",
        "label": "03077208->42986310",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "42986310",
        "value": 17.034128105851
    },
    {
        "id": "03077208->52289539",
        "label": "03077208->52289539",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "52289539",
        "value": 11.793152639087
    },
    {
        "id": "80355806->24563795",
        "label": "80355806->24563795",
        "categoryLabel": "自然人",
        "start": "80355806",
        "end": "24563795",
        "value": 19.801974538495
    },
    {
        "id": "03557017->28087251",
        "label": "03557017->28087251",
        "categoryLabel": "自然人",
        "start": "03557017",
        "end": "28087251",
        "value": 99
    },
    {
        "id": "23111915->23474232",
        "label": "23111915->23474232",
        "categoryLabel": "自然人",
        "start": "23111915",
        "end": "23474232",
        "value": 1.5927482742891
    },
    {
        "id": "16092130->23474232",
        "label": "16092130->23474232",
        "categoryLabel": "自然人",
        "start": "16092130",
        "end": "23474232",
        "value": 0.0003106356717042
    },
    {
        "id": "04212250->22522756",
        "label": "04212250->22522756",
        "categoryLabel": "自然人",
        "start": "04212250",
        "end": "22522756",
        "value": 100
    },
    {
        "id": "03077208->50891273",
        "label": "03077208->50891273",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "50891273",
        "value": 27.149321266968
    },
    {
        "id": "03077208->54667023",
        "label": "03077208->54667023",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "54667023",
        "value": 17.349673269747
    },
    {
        "id": "03077208->50858582",
        "label": "03077208->50858582",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "50858582",
        "value": 13.317110822953
    },
    {
        "id": "24730689->66829016",
        "label": "24730689->66829016",
        "categoryLabel": "自然人",
        "start": "24730689",
        "end": "66829016",
        "value": 33.333333333333
    },
    {
        "id": "42866764->91119148",
        "label": "42866764->91119148",
        "categoryLabel": "自然人",
        "start": "42866764",
        "end": "91119148",
        "value": 100
    },
    {
        "id": "03077208->42866764",
        "label": "03077208->42866764",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "42866764",
        "value": 27.586206896552
    },
    {
        "id": "83152761->82871406",
        "label": "83152761->82871406",
        "categoryLabel": "自然人",
        "start": "83152761",
        "end": "82871406",
        "value": 100
    },
    {
        "id": "70827383->23111915",
        "label": "70827383->23111915",
        "categoryLabel": "自然人",
        "start": "70827383",
        "end": "23111915",
        "value": 100
    },
    {
        "id": "80333992->16439219",
        "label": "80333992->16439219",
        "categoryLabel": "自然人",
        "start": "80333992",
        "end": "16439219",
        "value": 100
    },
    {
        "id": "42966996->90099622",
        "label": "42966996->90099622",
        "categoryLabel": "自然人",
        "start": "42966996",
        "end": "90099622",
        "value": 100
    },
    {
        "id": "56675977->52477011",
        "label": "56675977->52477011",
        "categoryLabel": "自然人",
        "start": "56675977",
        "end": "52477011",
        "value": 100
    },
    {
        "id": "03557017->90219295",
        "label": "03557017->90219295",
        "categoryLabel": "自然人",
        "start": "03557017",
        "end": "90219295",
        "value": 20
    },
    {
        "id": "24563795->50773233",
        "label": "24563795->50773233",
        "categoryLabel": "自然人",
        "start": "24563795",
        "end": "50773233",
        "value": 20
    },
    {
        "id": "53935556->50773233",
        "label": "53935556->50773233",
        "categoryLabel": "自然人",
        "start": "53935556",
        "end": "50773233",
        "value": 20
    },
    {
        "id": "03077208->90510460",
        "label": "03077208->90510460",
        "categoryLabel": "自然人",
        "start": "03077208",
        "end": "90510460",
        "value": 48.611111111111
    },
    {
        "id": "03557017->24991987",
        "label": "03557017->24991987",
        "categoryLabel": "自然人",
        "start": "03557017",
        "end": "24991987",
        "value": 90
    }
  ]
}

/*
let nodes = data.nodes.map((d, i) => {
  return {
    id: d.id,
    label: d.label,
    value: d.data && d.data.detail && d.data.detail.payload && d.data.detail.payload.basic && d.data.detail.payload.basic.shareholders
      ? d.data.detail.payload.basic.shareholders.reduce((prev, current) => current.stocks + prev, 0)
        : 0,
    categoryLabel: d.data && d.data.role ? d.data.role : ''
  }
})
let edges = data.links.map((d, i) => {
  return {
    id: d.id,
    label: d.id,
    categoryLabel: isNaN(d.source) === false ? '自然人' : '法人',
    start: d.source,
    end: d.target,
    value: d.percentage
  }
})
*/